[
    {
        "text": "We could have had an eminently excellently qualified professional woman leading us Instead we have Putin’s puppet pushing propaganda decimating our democracy I could weep about where we are now I could scream But instead I will channel my angry grief into a big Bluewave",
        "location": "",
        "retweet_count": 275,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "This is a list of 35 critical actions that we must take and encourage others to take in the defense of our democracy: 1 Vote in every election. 2 Donate to honorable candidates parties and civic organizations. 3 Call and write to our representatives in Congress.",
        "location": "Virginia, USA",
        "retweet_count": 1571,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Revocation of President's rule at 5.17 am? Swearing in at 7.45 am Press not informed? No official communique from governor Two gentlemen sworn in in utter secrecy? This is nothing but murder of democracy #MaharashtraGovtFormation",
        "location": "",
        "retweet_count": 1218,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "As Schiff said today he does not know what the republicans need to impeach trump.All the evidence is there,in court he would be guilty.What is wrong with the republicans When did they lose their loyalty to the constitution the law and democracy?Do they plan on being oligarchs?",
        "location": "United States",
        "retweet_count": 25,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The American intelligence community unequivocally blames Russia for attacking our elections and democracy When elected officials sow confusion around this fact or raise Ukraine they are doing the bidding of Vladimir Putin.",
        "location": "Bettendorf, IA",
        "retweet_count": 7237,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Democracy must mean democracy in the workplace as well. When I am president when 50 of workers in a unit sign a card to join a union plus one they will have a union End of discussion.",
        "location": "",
        "retweet_count": 2036,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#UPDATE Hong Kong's pro-democracy camp was headed for a thumping victory in district council elections local media reported on Monday a vote widely seen as a referendum on the Beijing-backed government's handling of months of violent political unrest",
        "location": "香港",
        "retweet_count": 178,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#HongKong stocks climbed after pro-democracy candidates swept the board in district council elections via #HKDCElections #HongKongProtests",
        "location": "Hong Kong",
        "retweet_count": 7,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The Hong Kong Human Rights and Democracy Act passed by both chambers of the United States Congress on Wednesday is expected to cause disruption in US-China relations #HongKong #香港",
        "location": "",
        "retweet_count": 9,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Congratulations to all the first-time District Council candidates in #HongKong who won on Sunday’s election The results speak for themselves the people of Hong Kong want a voice in their future The city's next generation of democracy should inspire us all to be engaged",
        "location": "Hong Kong",
        "retweet_count": 784,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "We elect thugs call them Chanakyas and then they murder our democracy in front of our eyes Gutter I'm unable to laugh beyond a few seconds We should be ashamed of ourselves Our collective conscience or the lack of it is alarming Thoo on us.",
        "location": "",
        "retweet_count": 144,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong elections seen as win for pro-democracy candidates after massive turnout Fox News",
        "location": "New York, USA",
        "retweet_count": 49,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "In case you haven’t figured it out Facebook is complicit in the destruction of our democracy When historians piece it together Facebook and Zuckerberg will be front and center Trump/Zuckerberg 2020.",
        "location": "United States",
        "retweet_count": 512,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "A stunning result for Hong Kong’s pro-democracy parties they have won 278 of the first 344 seats to be declared in local elections sweeping aside the pro-Beijing establishment which has only 42 The latest from our team on the ground",
        "location": "Hamden,  Connecticut",
        "retweet_count": 302,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "SOMEBODY ANYBODY PLEASE EXPLAIN❗️ believes Ben Carson lacks the ‘Intelligence to be HUD Secretary (after he claims she has no manners 🤣 Waters also says ‘ is undermining our democracy/being destructive",
        "location": "USA",
        "retweet_count": 16,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Zuckerberg is going to go down in history as having done the most damage to democracy and he doesn’t seem to realize it or care",
        "location": "Louisiana, USA",
        "retweet_count": 19,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Just as \"Einstein didn't need Maths to discover gravity\"(Hon Piyush Goel) the BJP/Modi/Shah didn't need Maths to destroy democracy",
        "location": "",
        "retweet_count": 915,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Former FBI spy-hunter Robert Anderson says Russia’s goals today are the same as in the Soviet era to sow discord in the U.S and doubt about our democracy around the world",
        "location": "Ontario, Canada",
        "retweet_count": 236,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hearing that the pro-#CCP candidates were \"unfairly treated in the #HongKongElection I can't help laughing Today is a victory of democracy despite the election manipulation. 1 Being asked to condemn police brutality is not comparable with being assaulted by thugs brutally",
        "location": "",
        "retweet_count": 69,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Powerful statement to Beijing by the people of Hong Kong This is democracy in action and we must stand with the brave protestors in Hong Kong",
        "location": "New York",
        "retweet_count": 17,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong Democracy Backers Win Big as Voters Flock to Polls Trump Says He’s ‘Standing With Xi (and With HK’s Protesters. China’s Internment Camps Ruled by Secrecy and Spying New Leak Shows How to say \"climate emergency in Chinese More",
        "location": "CN",
        "retweet_count": 6,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Yes We are idiots ! This is what Narendra Modi ji &amp Amit Shah thinks about 130 Crore Citizens of this country. Democracy is murdered every night but rather asking tough questions to the government Indian Media is clapping like cheer leaders. #MaharashtraPolitics",
        "location": "Chhattisgarh, India",
        "retweet_count": 59,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "As HongKongers go to the polls today know that as a sister democracy the United States is proud of you for exercising this fundamental right and will fiercely protect it from anyone who tries to take it away #FreeHongKong",
        "location": "",
        "retweet_count": 4911,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong Democracy Camp Heads for Stunning Win at Polls",
        "location": "Jackson, MS",
        "retweet_count": 80,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "You can’t have it both ways I choose the side of freedom and democracy both here and in Hong Kong",
        "location": "",
        "retweet_count": 120,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Israel is about to become the first country that considers itself a Western democracy to expel a researcher",
        "location": "World",
        "retweet_count": 162,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "If there's anything that should trend after Maharashtra govt formation it should be #yesaaremilkehumkopagalbanarahehai RT if you agree democracy ki aarti toh ho gayi aaj",
        "location": "",
        "retweet_count": 2271,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Looks like an anti-Beijing wave election",
        "location": "Hong Kong",
        "retweet_count": 1263,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Yes We need take out Democracy back from these unelected slackers and deep state globalist If they can’t be fired then build warehouses and cubicles in deep Blue states and move them out DC",
        "location": "USA",
        "retweet_count": 24,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "0911 stock market went up as democracy revived in the election last night #PolyU #BreakofDawn #HongKongProtests #standwithHK #Policestate #1124HK #StridewithHK",
        "location": "Hong Kong",
        "retweet_count": 4,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "totally normal democracy",
        "location": "Overland Park, KS",
        "retweet_count": 95,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Off the People. Bye the People. Far the People. PS some serious thoughts there on the recent turnout of events I Couldn't dare disagree :) #democracy",
        "location": "",
        "retweet_count": 2,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Democracy at work The people of #HongKong’s voice is being heard loud and clear today as votes are counted. Communist China should take a close look and reconsider their current posture Autonomy and human rights belong to HK",
        "location": "Evanston, IL",
        "retweet_count": 1185,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Pro democracy camp now is having a landslide victory in the district council election It reflects the support for democracy and the resentment towards the govt Democracy Now! #HongKong",
        "location": "",
        "retweet_count": 934,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong’s Pro-Democracy Candidates Poised to Win Majority",
        "location": "",
        "retweet_count": 420,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Americans take note The people of Hong Kong turned out with 71 participation to deliver to Beijing a clear and decisive loss In 2020 it is our turn Let’s show the world we love our democracy and cherished way of life just as much",
        "location": "",
        "retweet_count": 903,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "My overwhelming conclusion after the last few weeks hearings is that the in its current incarnation is a fundamental threat to our democracy Thread:",
        "location": "San Diego",
        "retweet_count": 12384,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong's pro-democracy candidates and citizens are waking up to a stunning victory in local elections that drew a record turnout 2.94 million votes 71.2 turnout this is Hong Kong elections history Democracy wins ✌ #StandWithHongKong #democracy #dkpol #dkmedier",
        "location": "",
        "retweet_count": 62,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Look the Liberal #MSM is doing the same thing they accused the Russians of doing...#BIAS REPORTING. i.e attempting to influence our 2020 elections by attacking our duly elected The media is a danger to our Democracy. #FakeNewsMedia",
        "location": "",
        "retweet_count": 54,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "“What politicians normally refer to as “issues are mere symptoms all of which share an underlying cause. #Marianne2020",
        "location": "",
        "retweet_count": 3,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Glenn Simpson and Peter Fritsch say that they are *still being paid by The Democracy Integrity Project the group founded by Daniel Jones that receives funding from George Soros and other wealthy donors Fusion was paid $3.8 million in 2017",
        "location": "",
        "retweet_count": 937,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I am so proud of freedom lovingers who turned 70 of eligible voters out You did it for your brave frontlinekids &amp all their sacrifices This is a new day forautonomy freedom &amp democracy God bless you ALL",
        "location": "Hong Kong",
        "retweet_count": 2628,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Gerrymandering disenfranchisement and making voting difficult for too many is counter to our democratic ideals Our Representative democracy is at risk when don’t encourage and facilitate voting",
        "location": "United Kingdom",
        "retweet_count": 61,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The West says Hong Kong is ruled by a dictatorship despite the opposition being able to run in and win elections. Meanwhile the West says the military coup in Bolivia is a \"democratic transition\" as it massacres dissidents. For them \"democracy just means serving the West",
        "location": "Brooklyn, NY",
        "retweet_count": 135,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Bro NCP Ajit Pawar BJP I hope there are soggy sandwiches and chips along with cake at this stupid musical-chairs contest that you guys have reduced Maharashtra to INC SS you guys seem as clueless as the rest of us Never forget the names of all the sellers of Democracy!",
        "location": "",
        "retweet_count": 80,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong’s pro-democracy parties sweeping pro-Beijing establishment aside in local elections early results show",
        "location": "",
        "retweet_count": 165,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "In 2020 Americans have a stark, existential choice to make: Either we save our democracy by removing Trump from office &amp replacing Republicans w/as many Dems as possible. Or we lose our democracy w/Trump remaining in power &amp GOP in control of Senate. America is at a crossroads.",
        "location": "CA",
        "retweet_count": 7,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong District Council election Pro-democracy candidates win majority of seats as pro-Beijing camp suffers historic defeat #HongKong #China #antielab #antiELABhk #HongKongProtests",
        "location": "台北市, 台灣",
        "retweet_count": 306,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Do you know what the absence of protests means It doesn't mean that everything is normal Instead it means that people have given up on the government's false pretense of being a democracy. cc",
        "location": "",
        "retweet_count": 1354,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Any other country if govt had hijacked democracy by illegally appointing a CM people would've been on streets &amp media would've condemned govt In India people don't give a damn &amp media shamelessly glorifies scumbaggery People have accepted this as a norm. #MaharashtraPolitics",
        "location": "ರಿಯಾದ್, ಸೌದಿ ಅರೇಬಿಯಾ",
        "retweet_count": 350,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Per 24.11electoral results those #PolyU students should be granted amnesty immediately Commissar Lam threaded oners autonomy/freedom/democracy w #extraditionbill/anti-mask bill Thosestudents defended their rights/were met w brutality/human rights abuse",
        "location": "Hong Kong",
        "retweet_count": 982,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I can’t sleep even though I am tired Today’s election is historical for Hong Kong and the World Honoured to be on Hong Kong ground To all my friends Democracy wins✌ #StandWithHongKong #denmark #UmbrellasUp #democracy #umbrellarevolution",
        "location": "Hong Kong",
        "retweet_count": 410,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Page 50 of Tory Manifesto It’s coming Voter ID at polling stations ‘We will protect the integrity of our democracy by introducing identification to vote at polling stations’ US Republican tactic to suppress the votes of those you don’t like coming to U.K?",
        "location": "",
        "retweet_count": 2303,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Today the people of #HongKong turned out to vote in record numbers demanding democracy and autonomy from Beijing The free world hears you and we #StandWithHongKong",
        "location": "Vancouver, British Columbia",
        "retweet_count": 248,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#ExposeCommunism Communists Doesn't believe in democracy Is it Good for New india?",
        "location": "",
        "retweet_count": 21,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Remind me again just how we as a country are the epitome of democracy ⁦ is a living breathing lethal virus destroying this country’s legacy of freedom Is there no antidote strong enough to fight off his systemic poisoning",
        "location": "Orange, California",
        "retweet_count": 328,
        "favorite_count": 0,
        "time_zone": null
    }
]