[
    {
        "text": "When I was typing my last tweet another horrible news came up: One more woman's burnt body found in Telangana's Shamshabad near the spot where Dr Priyanka Reddy's body was discovered. What is happening in India? Have we failed as humans? Have we failed as a society?",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 7353,
        "favorite_count": 20124,
        "time_zone": null
    },
    {
        "text": "Dr Priyanka Reddy raped &amp brutally burnt in Telangana Police arrested Naveen Muhammad Pasha Keshavulu Shiva Was her scooty deliberately punctured? When someone calls India unsafe for girls we react a lot to it But when such cases happen Judiciary needs to act fast.",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 6553,
        "favorite_count": 19089,
        "time_zone": null
    },
    {
        "text": "Inspired by the motto of ‘Sabka Saath Sabka Vikas Sabka Vishwas and with the blessings of 130 crore Indians the NDA Government has continued working towards developing India and empowering the lives of 130 crore Indians with renewed vigour #6MonthsOfIndiaFirst",
        "location": "India",
        "created_at": "11/30/19",
        "retweet_count": 3718,
        "favorite_count": 22238,
        "time_zone": null
    },
    {
        "text": "Why are Nirbhaya's rapists still alive? When was the last time a rapist was hanged in India 15 years ago Telangana Home Minister questioned why Priyanka Reddy called family not police? Will he explain why did police say \"she might've eloped when her parents approached them?",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 5930,
        "favorite_count": 13590,
        "time_zone": null
    },
    {
        "text": "If Lord Rama is not part of your culture you are NOT a perfect Muslim let me be clear India is secular ONLY because it is a Hindu majority nation says Dr KK Muhammed (suspended for declaring that a temple once stood under the Babri mosque at the",
        "location": "",
        "created_at": "11/29/19",
        "retweet_count": 3244,
        "favorite_count": 6870,
        "time_zone": null
    },
    {
        "text": "Had in-depth conversations with President on aspects relating to security The menace of terror has plagued both India and Sri Lanka Our nations will cooperate in counter terror training",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 1718,
        "favorite_count": 9521,
        "time_zone": null
    },
    {
        "text": "Addressed the concluding session of the 47th All India Police Science Congress in Lucknow. It is imperative to bolster internal security in order to become a $5 trillion economy AIPSC is an important platform for brainstorming &amp adopting new practices in the field of Policing",
        "location": "",
        "created_at": "11/29/19",
        "retweet_count": 1753,
        "favorite_count": 12285,
        "time_zone": null
    },
    {
        "text": "Condolences on the demise of eminent statesman and former Prime Minister of Japan Mr Yasuhiro Nakasone. We will always remember his pathbreaking visit to India which was the first by a Japanese PM after a gap of 23 years.",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 2430,
        "favorite_count": 16795,
        "time_zone": null
    },
    {
        "text": "During the last six months we have taken numerous decisions that have furthered development accelerated social empowerment and enhanced India’s unity We aspire to do even more in the times to come so that we create a prosperous and progressive New India #6MonthsOfIndiaFirst",
        "location": "India",
        "created_at": "11/30/19",
        "retweet_count": 1857,
        "favorite_count": 9231,
        "time_zone": null
    },
    {
        "text": "Once appointed protem Speaker continues till the regular Speaker gets elected But protem Speaker also got changed and this happened for the first time in the history of India At every step our great constitution is being insulted by this government. #MahaMurderOfDemocracy",
        "location": "Maharashtra State,India",
        "created_at": "11/30/19",
        "retweet_count": 2874,
        "favorite_count": 10747,
        "time_zone": null
    },
    {
        "text": "Where I expose the President of Editor’s Guild &amp for stealing my personal video from a private event and using out of context with to sabotage India’s great diplomatic success in #Kashmir narrative Pl share and expose them",
        "location": "Mumbai, Himalayas and Heaven ",
        "created_at": "11/30/19",
        "retweet_count": 3307,
        "favorite_count": 4935,
        "time_zone": null
    },
    {
        "text": "-France has 15 years of jail or death for rape accused -China has death sentence or castration -Egypt hangs the culprits -India has a long process of justice High time we update our laws to punish these demons #Priyankareddy",
        "location": "New Delhi, India",
        "created_at": "11/29/19",
        "retweet_count": 2041,
        "favorite_count": 5150,
        "time_zone": null
    },
    {
        "text": "Happy to receive on his first overseas visit as the President of Sri Lanka His visit is a testimony to the time-tested ties between India and Sri Lanka and will help strengthen our bonds as well as energise our partnership",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 2642,
        "favorite_count": 18860,
        "time_zone": null
    },
    {
        "text": "Another daughter of India is gone Don’t let sexual-crimes against women get lost in the war of narratives. Rapists of Priyanka Reddy Naveen Kesavulu Siva and Mohammad Pasha The four monsters punctured her vehicle kidnapped her gang-raped her and then set her on fire",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 3319,
        "favorite_count": 5920,
        "time_zone": null
    },
    {
        "text": "Absolutely agree We had a toilet till 14 August 1947 Now you say India does not have toilets What happened on 14 August that India started having a toilet availability problem? Please don’t embarrass yourself Let your trolls do that for you",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 1132,
        "favorite_count": 4891,
        "time_zone": null
    },
    {
        "text": "Every engagement of India with the rest of the world is going to rest on the principles of natural &amp national interest. Our Govt is focused on ensuring a level playing field &amp a good deal for investors yet ensuring that the rules of the game are properly adhered to",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 109,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Maharashtra assembly session starts without Vande Mataram Is this the new secular Shiv Sena What happened to its core values and honoring of Bal Thackeray #VandeMataramUddhav",
        "location": "Hong Kong",
        "created_at": "11/30/19",
        "retweet_count": 452,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Pragya Thakur was Amit Shah’s personal choice to take on Digvijaya Singh in Bhopal Read this excerpt from '2019 How Modi Won India by Rajdeep Sardesai",
        "location": "Dubai, United Arab Emirates",
        "created_at": "11/30/19",
        "retweet_count": 180,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "China’s carbon emission change since 2000 +208% India’s carbon emission change since 2000 +155% US carbon emission change since 2000 -10% I’m curious how taxing Americans will improve OTHER countries treatment of the environment 🤔",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 32,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Fuck India and the men who live there",
        "location": "Putrajaya Federal Territory, M",
        "created_at": "11/30/19",
        "retweet_count": 2959,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "India to become $5 trillion economy by 2024 READ",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 91,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The purest most loveliest #RashamiDesai said what whole India wants to say to #AsimRiaz “Asim tu wazir hai I swear I wanna see Rash n Asim as two finalists #RashamiDesaiRulingBB #Bb13 #BiggBoss13",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 236,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Bollywood is at the forefront of propagating Islamophobia in India via",
        "location": "India",
        "created_at": "11/30/19",
        "retweet_count": 44,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hon’ble Defence Minister of Japan Mr Kono Taro visited IAF Base at Hindan today He is on a 02 day bilateral visit to India. Japanese Defence Minister &amp accompanying delegation were received by Air Mshl D Choudhury SASO WAC &amp Air Cmde R Talwar AOC AFS Hindan",
        "location": "兵庫県",
        "created_at": "11/30/19",
        "retweet_count": 303,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hey what is your motive behind maliciously promoting an unauthorised and edited clip out of context from my private event from my personal FB page to sabotage India’s narrative on Kashmir Can someone tell me",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 1054,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "V interesting Australia India &amp Indonesia navies have started a trilateral maritime security workshop #IndoPacific",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 29,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Most powerful countries 2019. 1 US 2 Russia 3 China 4 Germany 5 UK 6 France 7 Japan 8 Israel 9 Saudi 10 S Korea 11 UAE 12 Canada 13 Iran 14 Switzerland 15 Australia 16 Turkey 17 India 18 Italy 19 Iraq 20 Singapore (US News and World Report)",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 1540,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Iss fight mein aap kisse support karenge RT for _shukla &amp comment for _india #BiggBoss13 #BB13 #WeekendKaVaar",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 1600,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Central Pollution Control Board Ban on Fireworks Factories in India Plz sign",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 69,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Jairam Ramesh says Congress created Shiv Sena &amp functioned as a B-Team and sleeper cell of to fight rival unions Saamna goes silent &amp Uddhav swallows insults to the legacy of Balasaheb Thackeray by sacrificing Self respect for Self preservation.",
        "location": "India",
        "created_at": "11/30/19",
        "retweet_count": 1376,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Every person in power in India needs to take responsibility for the horrific gang rapes there That includes Bollywood producers and stars Time to get rid of item numbers where one scantily clad female is made to dance for hundreds of lustful men in a dark room. #HyderabadHorror",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 208,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "7 year old me drinking the coffee my grandparents made me",
        "location": "Moving Forward ",
        "created_at": "11/30/19",
        "retweet_count": 26085,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Indian diplomat in New York calls for India to implement Israeli model in Kashmir This model includes war crimes and apartheid. India is Israel’s biggest arms importer End this exchange of arms and repressive tactics #MilitaryEmbargo on Israel now",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 153,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "On N3 Highway between Johannesburg&amp;Durban there is a town Harrismith named to honor Sir Harrismith who order killing of king Hintsa conquest&amp;dispossession of indigenous people in the cape defeat of natives in India and americas LadySmith town in KZN is named to honour his wife",
        "location": "Johannesburg/Dbn South Africa",
        "created_at": "11/30/19",
        "retweet_count": 1125,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "And we wonder why #India is a shabbily Third World filth zone Which official will eagerly participate in any development project Law was folllowed for each tree felled multiple trees were planted now the people who worked on Mumbai Metro face prosecution We are a rotten lot",
        "location": "The Republic",
        "created_at": "11/30/19",
        "retweet_count": 1232,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Nearly all those committing gang rapes in India are uneducated men yet Bollywood regularly glamourises imagery of a scantily clad woman at the centre of a huge group of lusting men Indian cinema isn't just to blame but needs to take responsibility #HyderabadHorror #PriyankaReddy",
        "location": "unceded coast salish territory",
        "created_at": "11/30/19",
        "retweet_count": 149,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#LtGenRanbirSingh #ArmyCdrNC and all ranks salute the supreme sacrifice of Nb Sub Tsewang Gialshan and Rfn Padma Norgais offer deepest condolences to the families _India",
        "location": "West Bengal, India",
        "created_at": "11/30/19",
        "retweet_count": 191,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "That hoe durk say “during the show females can take pictures with me after the show they can’t I ain’t losing India bro so faithful so she gotta be solid",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 25,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "One of India’s foremost forensic experts Dr RK Sharma dismissed the claim that #JudgeLoya died of a heart attack According to Sharma the documents showed signs of possible trauma to the brain and even possible poisoning. From Feb 2018 Atul Dev in",
        "location": "India",
        "created_at": "11/30/19",
        "retweet_count": 252,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Whole Gujarat and india is voting for Rashami #RashamiDesaiRulingBB",
        "location": "United States",
        "created_at": "11/30/19",
        "retweet_count": 77,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "INDIA NO COUNTRY FOR WOMEN #justiceforpriyanakareddy #JusticeForRoja",
        "location": "Pune, India",
        "created_at": "11/30/19",
        "retweet_count": 117,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Girl arrested for protesting against rape in India's capital. The police tortured her with nail &amp released her after she swore to not protest. World's largest democracy for dummies",
        "location": "Lombardy, Italy",
        "created_at": "11/30/19",
        "retweet_count": 504,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Lost a bond that I wanted forever.‍♂️",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 292,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Only 6 days until my Aviation Tour in India kicks off Tickets here",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 36,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "It was #RajivBajaj who was the first industrialist to trash #Demonetisation...there was nervous silence from his peers then... Similar nervousness today as dad #RahulBajaj did the unthinkable &amp posed a blunt question to about the atmosphere of fear prevailing in India",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 777,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "It took 96 weeks and thousands of volunteers to clean up Versova Beach in Mumbai India The payoff Hundreds of thousands of seaturtles hatching this week First time in decades Anything can be cleaned",
        "location": "Australia",
        "created_at": "11/30/19",
        "retweet_count": 120254,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Uddhav Thackeray Uddhav Thackeray wants ‘in-depth probe into Justice Loya’s death Mumbai News Times of India",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 479,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "While this terrorist who is accused of killing dozens of Muslims is a member of India's Parliament",
        "location": "پاکستان",
        "created_at": "11/30/19",
        "retweet_count": 414,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Best countries to invest in 2019. 1 Uruguay 2 Saudi 3 Costa Rica 4 Luxembourg 5 India 6 Poland 7 Qatar 8 Vietnam 9 Slovenia 10 Chile 11 NZ 12 Latvia 13 Malaysia 14 Singapore 15 Denmark 16 Russia 17 Lithuania 18 Indonesia 19 Italy 20 Brazil (US News)",
        "location": "México",
        "created_at": "11/30/19",
        "retweet_count": 2034,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Pickens didn’t start the fight but he sure as shit finished it ",
        "location": "Atlanta, GA",
        "created_at": "11/30/19",
        "retweet_count": 615,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Why are people afraid of criticising you Rahul Bajaj to Amit Shah (+Nirmala Sitharaman &amp Piyush Goyal at ET event.. Then is there any doubt that Godse was a terrorist It needed someone of his stature &amp courage to speak out from Corp India",
        "location": "Flower Mound, TX",
        "created_at": "11/30/19",
        "retweet_count": 617,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "There is no one today that can deny the sharp slowdown in India’s economy &amp its disastrous consequences particularly for our farmers,youth &amp poor.The GDP figures released today point that the growth rate of our economy in Q2FY20 is as at 4.5%:Former PM DrSingh #BJPHataoDeshBachao",
        "location": "Dimna Road, Mango",
        "created_at": "11/30/19",
        "retweet_count": 27,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Actually Modi Sarkar’s entire team does not know Economics India's Modi Slump is a direct result of policy &amp political misadventures of BJP from DeMo on .. says GDP growth is only 1.5%! #BJPHataoDeshBachao",
        "location": "Hyderabad",
        "created_at": "11/30/19",
        "retweet_count": 346,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "World needs to stand up for 8M people of #Kashmir who have been deliberately silenced by the so called world’s largest democracy India #StandWithKashmir #Kashmir",
        "location": "London, United Kingdom",
        "created_at": "11/30/19",
        "retweet_count": 15,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "While the nation is in an unprecedented recession How does a man increase his wealth &amp become the 9th richest in the world Hard to believe But sadly it's the fact. While the Poor are getting poorer rich are getting richer. #ModiHaiToSabMumkinHai",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 135,
        "favorite_count": 0,
        "time_zone": null
    }
]