[
    {
        "text": "Dr Priyanka Reddy raped &amp brutally burnt in Telangana Police arrested Naveen Muhammad Pasha Keshavulu Shiva Was her scooty deliberately punctured? When someone calls India unsafe for girls we react a lot to it But when such cases happen Judiciary needs to act fast.",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 5772,
        "favorite_count": 16454,
        "time_zone": null
    },
    {
        "text": "When I was typing my last tweet another horrible news came up: One more woman's burnt body found in Telangana's Shamshabad near the spot where Dr Priyanka Reddy's body was discovered. What is happening in India? Have we failed as humans? Have we failed as a society?",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 4421,
        "favorite_count": 10742,
        "time_zone": null
    },
    {
        "text": "I agree with His family knows how to give respect to real patriots like Yasin Malik Wait his father was a great patriot who sold a part of India’s wealth to Bofors",
        "location": "Mumbai, Himalayas and Heaven ",
        "created_at": "11/28/19",
        "retweet_count": 3496,
        "favorite_count": 10724,
        "time_zone": null
    },
    {
        "text": "Happy to receive on his first overseas visit as the President of Sri Lanka His visit is a testimony to the time-tested ties between India and Sri Lanka and will help strengthen our bonds as well as energise our partnership",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 2431,
        "favorite_count": 17345,
        "time_zone": null
    },
    {
        "text": "Condolences on the demise of eminent statesman and former Prime Minister of Japan Mr Yasuhiro Nakasone. We will always remember his pathbreaking visit to India which was the first by a Japanese PM after a gap of 23 years.",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 1877,
        "favorite_count": 12188,
        "time_zone": null
    },
    {
        "text": "22 of India’s groundwater dried up or in critical state. Now Israel comes forward to help India. Israel is providing guidance &amp training in water management in 28 Centres of Excellence in India Over 7 desalination plants on the coast of India are using Israeli technology",
        "location": "India",
        "created_at": "11/28/19",
        "retweet_count": 3643,
        "favorite_count": 13970,
        "time_zone": null
    },
    {
        "text": "Terrorist Pragya calls terrorist Godse a patriot A sad day in the history of India’s Parliament.",
        "location": "12, Tughlak Lane, New Delhi",
        "created_at": "11/28/19",
        "retweet_count": 21171,
        "favorite_count": 84333,
        "time_zone": null
    },
    {
        "text": "If Lord Rama is not part of your culture you are NOT a perfect Muslim let me be clear India is secular ONLY because it is a Hindu majority nation says Dr KK Muhammed (suspended for declaring that a temple once stood under the Babri mosque at the",
        "location": "",
        "created_at": "11/29/19",
        "retweet_count": 2788,
        "favorite_count": 5806,
        "time_zone": null
    },
    {
        "text": "Hundreds of Rohingya Muslims who entered Saudi Arabia illegally have been languishing in detention centres for indefinite time Everyday new raids are taking place and some detainees have even tried committing suicide And Ummah has no problem with it. Imagine India doing this.",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 2043,
        "favorite_count": 5046,
        "time_zone": null
    },
    {
        "text": "Another daughter of India is gone Don’t let sexual-crimes against women get lost in the war of narratives. Rapists of Priyanka Reddy Naveen Kesavulu Siva and Mohammad Pasha The four monsters punctured her vehicle kidnapped her gang-raped her and then set her on fire",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 3014,
        "favorite_count": 5190,
        "time_zone": null
    },
    {
        "text": "Why are Nirbhaya's rapists still alive? When was the last time a rapist was hanged in India 15 years ago Telangana Home Minister questioned why Priyanka Reddy called family not police? Will he explain why did police say \"she might've eloped when her parents approached them?",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 4679,
        "favorite_count": 10491,
        "time_zone": null
    },
    {
        "text": "Modi Govt is delivering on the promise of New India Bribery incidents in the country reduced by 10 between 2017-18 according to a survey by Transparency International India &amp LocalCircles India jumped 3 places to stand at 78 on the Corruption Perception Index 2018",
        "location": "6-A, Deen Dayal Upadhyay Marg,",
        "created_at": "11/29/19",
        "retweet_count": 715,
        "favorite_count": 3249,
        "time_zone": null
    },
    {
        "text": "President , Today’s talks were very productive We exchanged views on many bilateral and global subjects India’s is committed to support our sisters and brothers of Sri Lanka in their developmental aspirations",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 1064,
        "favorite_count": 5619,
        "time_zone": null
    },
    {
        "text": "Had in-depth conversations with President on aspects relating to security The menace of terror has plagued both India and Sri Lanka Our nations will cooperate in counter terror training",
        "location": "India",
        "created_at": "11/29/19",
        "retweet_count": 1342,
        "favorite_count": 7192,
        "time_zone": null
    },
    {
        "text": "Since 2015 #RahulGandhi travelled 247 times abroad &amp;1892 times within India without informing SPG Amit Shah in Lok Sabha In four years 247 visits abroad indicates being run by Gandhi family from overseas Or that after every 3 days in India #Pappu needs detox abroad",
        "location": "New Delhi, India",
        "created_at": "11/28/19",
        "retweet_count": 1610,
        "favorite_count": 4332,
        "time_zone": null
    },
    {
        "text": "ICE set up a fake University &amp lured students mostly from India to enroll The students are being arrested on charges of federal conspiracy and deported. And our taxpayer dollars funded the entire racist xenophobic criminal endeavor. You ask why I'm so mad Why aren't you?",
        "location": "Austin, TX",
        "created_at": "11/28/19",
        "retweet_count": 1804,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "To be precise it’s not a day of shame for Parliament but for those who sent this Godse bhakt to Parliament The people directly responsible for this act that shames India are the Prime Minister and the Home Minister",
        "location": "Atlanta, Georgia, USA ",
        "created_at": "11/28/19",
        "retweet_count": 1430,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Fabulous #India consul general in the US Sandeep Chakravorty Reassuring true Kashmiri’s (Hindus that one day they will be able to return to their land 'It has happened in the Middle East If the Israeli people can do it we can also do it #Kashmir",
        "location": "",
        "created_at": "11/28/19",
        "retweet_count": 707,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "But EC said that election should be held in 5 phases in Jharkhand because of Naxalism Home Monster Tadipdar Shah's brain is a devil's workshop 24/7 ",
        "location": "India",
        "created_at": "11/28/19",
        "retweet_count": 81,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Facebook and Instagram were not available to users in India Sri Lanka and some other parts of the world The two social media platforms owned by Facebook Inc were reportedly down across the world #LKA #SriLanka #facebookdown #instagramdown",
        "location": "kandy",
        "created_at": "11/28/19",
        "retweet_count": 28,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Sweden 10M people. India 1300 M people. Sweden 0.76 of India They can first take care of their \"gang war problem",
        "location": "Mumbai, India",
        "created_at": "11/28/19",
        "retweet_count": 498,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "(at 2:23 \".. Afghanistan Pakistan &amp Bangladesh are Islamic states where religious minorities are forcefully converted their women are dishonored &amp girls abducted\" India is repeatedly slandering allies (Afghanistan Bangladesh &amp Pakistan &amp nobody is taking note",
        "location": "",
        "created_at": "11/28/19",
        "retweet_count": 63,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "1st cabinet meeting in #Maharashtra and you have #AjitPawar attending it and he is not a minister So a super CM behind a notional CM.Echoes of super PM #SoniaGandhi with super cabinet of #NAC ruling India for 10 years When asked NCP and Congi Spokies say Who are you to ask",
        "location": "Putting the gand in Uganda ",
        "created_at": "11/28/19",
        "retweet_count": 704,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "If we (#Sweden are there to lift the #Kashmir issue on all venues and demand justice for the Kashmiri people that's alright. If we are there to sell #Gripen endless shame on us We will be directly responsible for the severe situation in the region. #India #Pakistan",
        "location": "Adelaide, South Australia",
        "created_at": "11/28/19",
        "retweet_count": 43,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "When British ruled India we fought only against them We would have got freedom long back if we had finished off Indians who backed British Even now if v wanna chase foreign lady to Italy Boycott the anti-nationals who support her Then see how her entire family will disappear",
        "location": "USA",
        "created_at": "11/28/19",
        "retweet_count": 366,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Well done India! Delhi Police on Monday prevented a major terror strike in the Capital apprehended three men linked to an Islamic State terror cell and recovered Improvised Explosive Devices (IED from them",
        "location": "",
        "created_at": "11/28/19",
        "retweet_count": 1276,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Outrageous 250 Indian students were arrested for enrolling in American university that was entirely created by American police to trick them Then ICE arrests them saying you broke immigration law 80 deported to India Where are human rights groups",
        "location": "India / US",
        "created_at": "11/28/19",
        "retweet_count": 158,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#AsimRiaz is Ruling on twitter Right now in India Top 4 Trends in India Right now Asim Ki khairat se #ParasChabbra b trend Kar rha hai but for Negative Reasons #AsimRaiz #WeAreProudOfYouAsim",
        "location": "",
        "created_at": "11/28/19",
        "retweet_count": 565,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Until Indian Army is cut by 3,00,000 (3L troops soonest &amp military threats reviewed India will not be war ready With focus on CI ops for all 3 services with Gen Rawat as CDS this is impossible India will get bigger shock than 1962 in coming yrs #ChinaPakInteroperability",
        "location": "Noida/Delhi",
        "created_at": "11/28/19",
        "retweet_count": 39,
        "favorite_count": 105,
        "time_zone": null
    },
    {
        "text": "Sweden calls for lifting of restrictions in Kashmir nudges India for talks with Pakistan india news Hindustan Times",
        "location": "Ireland, Scotland",
        "created_at": "11/28/19",
        "retweet_count": 246,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Who will take responsibility of lakhs of bodies of Hindus and Sikhs sent by trains from Pakistan  to India  at time of Partition Who will justify fast by mahatma gandhi at that time to give 90 crores to Pakistan ? Have guts Respond",
        "location": "Texas, USA",
        "created_at": "11/28/19",
        "retweet_count": 42,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I served so many Chicago celebrities at Hooters That nigga Lud Foe talk like that in real life and he ghetto asf Queen Key really tiny asf India pretty asf in real life and she thick asl and dude off black Ink can get it any day.",
        "location": "303",
        "created_at": "11/28/19",
        "retweet_count": 662,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "A civilisational relationship nurtured through millennia President on his first overseas visit since assuming office arrives in India on a State visit at PM ’s invitation demonstrating the strength &amp dynamism of - relations #NeighbourhoodFirst",
        "location": "India",
        "created_at": "11/28/19",
        "retweet_count": 208,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Contribute to free our tribal people from clutches of deceitful missionaries Support Agniveer's Vedic Graam Project Let's not cry conversion Let's respond where it matters. 1 UPI agniveerupi 2 India 3 Outside India Om.",
        "location": "",
        "created_at": "11/28/19",
        "retweet_count": 134,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Chinese social media app TikTok suspends a teen’s account over a viral video encouraging people to learn about Muslims in China. Video credit feroza.x . . #viralvideo #Videos #muslimsinchina #Muslims #China #USA #India #TikTok",
        "location": "Giza, Egypt",
        "created_at": "11/28/19",
        "retweet_count": 19,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "_Of_Swag Only Tamil industry has the best of talents in India. There is no one in TFI to match our youngsters like Thalapathy Vijay or versatile actor Dhanush. They both have come up against all odds. Hard work &amp Talent matters Your heroes have no guts to act in social message movies.",
        "location": "தலைவர் மனதில்...",
        "created_at": "11/28/19",
        "retweet_count": 14,
        "favorite_count": 48,
        "time_zone": null
    },
    {
        "text": "Still Trending in India #AsimRiaz #AsimRaiz #WeAreProudOfYouAsim",
        "location": "",
        "created_at": "11/28/19",
        "retweet_count": 18,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Two bomb threats in 24 hours keep Tamil Nadu police busy",
        "location": "Republic of Balochistan",
        "created_at": "11/28/19",
        "retweet_count": 24,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hey boss sorry I’m 3 hours late I was trying to figure out how influencers tuck giant sweaters into tiny skirts",
        "location": "East Midlands, England",
        "created_at": "11/28/19",
        "retweet_count": 24317,
        "favorite_count": 0,
        "time_zone": null
    }
]