[
    {
        "text": "A great way to begin the #Thanksgiving2019 weekend has signed the #hongkong Human Rights &amp Democracy Act",
        "location": "",
        "retweet_count": 3209,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Finally After 5 years of hard work we made it happen Thank you for the protestors on the ground in HK. Donald Trump signs Hong Kong Human Rights and Democracy Act into law brushing off China’s warnings",
        "location": "",
        "retweet_count": 1707,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "My dear friend Bibi Thank you for your message on India’s #ConstitutionDay Israel is a cherished strategic partner We share and value the same principles of democracy",
        "location": "CHENNAI,TAMILNADU",
        "retweet_count": 2894,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "laying hands on the madman #ChristianDominionism #ReligiousTyranny #ChristianTheocracy #RepublicanNewConfederacy RT Why #ChristianNationalism is an existential threat to #democracy",
        "location": "",
        "retweet_count": 6,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Kevin Lam The Hong Kong election results were a vital step but the pro-democracy protesters still have a long way to go",
        "location": "",
        "retweet_count": 995,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "It is great news that the Hong Kong Human Rights and Democracy Act has been signed into law. It is now crystal clear that America stands with the people of Hong Kong in their struggle for accountability and democracy",
        "location": "",
        "retweet_count": 550,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "BREAKING U.S President Donald Trump has signed the Hong Kong Human Rights and Democracy Act into law after both houses of Congress strongly supported and passed their versions of the legislation Read below is here #HongKong #HongKongProtests",
        "location": "",
        "retweet_count": 155,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Historic: President Trump just signed the Hong Kong Human Rights and Democracy Act While Hong Kong freedom fighters wave the American flag and fight against Communism American ANTIFA rioters wave the communist flag and fight against America RT if you stand with Hong Kong!",
        "location": "",
        "retweet_count": 1845,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Imagine The November 2020 election is over and Trump has lost And yet he signals that he does not intend to leave office Will you take to the streets as people around the world have done to preserve our democracy?",
        "location": "Texas",
        "retweet_count": 558,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "After Pres Trump signed the HK Human Rights &amp Democracy Act we have a clear message for China We will not be bullied intimidated or crushed in our struggle for freedom #HongKongHumanRightsAndDemocracyAct ⁦ _watch ⁦ ⁦ #HongKong",
        "location": "",
        "retweet_count": 114,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "First Lady Melania Trump's response to booing she received in Baltimore this morning “We live in a democracy and everyone is entitled to their opinion...I remain committed to educating children on the dangers and deadly consequences of drug abuse. NYT",
        "location": "",
        "retweet_count": 7827,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "It’s time we take a stand against a rigged economy that is leaving the average American behind It’s time we create a brighter future for our children It’s time for real democracy reform It’s time we recognize and value our humanity It’s #TimeForYang",
        "location": "",
        "retweet_count": 233,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Me in the on today's growing unrest &amp the legacy of the global justice movement. \"My hope is that two decades on from now someone’s not writing a piece about how this moment of political crisis and mass protests was a missed opportunity.\"",
        "location": "Philadelphia, PA",
        "retweet_count": 32,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The Hong Kong Human Rights and Democracy Act is now law Beijing has a choice between honoring its commitments to Hong Kong or facing the consequences",
        "location": "San Diego, CA",
        "retweet_count": 643,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "This is pretty sweet Another win for ❤️VOTE RED ❤️",
        "location": "",
        "retweet_count": 37,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Excellent to see #StandWithHongKong &amp sign the Hong Kong Human Rights and Democracy Act which includes my bill calling for reevaluating privileges for #HongKong in light of encroachments on HK's autonomy by the Chinese Communist Party.",
        "location": "",
        "retweet_count": 2107,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "China's crackdown in Hong Kong has strengthened the resolve of protestors. Our tracking data ( shows how public opinion has shifted dramatically in a year. Almost half the population who'd previously been satisfied with democracy levels in HK now find it lacking",
        "location": "Hong Kong",
        "retweet_count": 1055,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I’m a huge supporter of the BBC but if they aren’t able to conduct an interview with the Prime Minister then the damage done to their reputation and our democracy will be incalculable",
        "location": "Liverpool, UK",
        "retweet_count": 2217,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "“Tump had signed the Hong Kong Human Rights and Democracy Act despite protests from officials in Beijing who complain that the legislation meddles in their domestic matters “",
        "location": "",
        "retweet_count": 433,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "BREAKING President Donald Trump has signed into law the Hong Kong Human Rights and Democracy Act of 2019",
        "location": "",
        "retweet_count": 1099,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The ppl of Hong Kong are fighting for freedoms &amp liberties just like those we cherish in our great country Grateful POTUS just signed legislation to stand strong w/the ppl of Hong Kong who have taken to the streets &amp ballot box w/dreams of a better future &amp love of democracy.",
        "location": "United States of America",
        "retweet_count": 584,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "\"If Trump gets away with these violations it will stand as precedent for more Presidents to get away with violating our laws We must hold him accountable to protect our freedoms Polls &amp ratings are irrelevant our Democracy is not it’s on life support.\"",
        "location": "Illinois, USA",
        "retweet_count": 21,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I‘m also glad that my PROTECT Hong Kong Act was signed into law It will ensure that U.S police and crowd control equipment is not used to suppress pro-democracy protesters in Hong Kong. This is a good day for human rights and a good day for democracy.",
        "location": "",
        "retweet_count": 161,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "BREAKING In a major rebuke of China Trump has signed a bill reaffirming U.S support for Hong Kong's autonomy after months of pro-democracy protests",
        "location": "",
        "retweet_count": 728,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I know my \"1st best friend Regina Ip's lobbying effort againstHuman Rights &amp Democracy Act becoming law failed miserably",
        "location": "Hong Kong",
        "retweet_count": 164,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "This is #imperialism there's no other word for it The U.S doesn't care about #democracy for #Venezuela Convicted criminal #ElliotAbrams openly says America wants to seize oil and give it to #Chevron",
        "location": "",
        "retweet_count": 14,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Today marks a great victory for the people of #HongKong and the fight for autonomy and human rights! Thank you for taking a stand against China’s aggression and signing the Hong Kong Human Rights and Democracy Act into law",
        "location": "North Carolina",
        "retweet_count": 1812,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "So Scott Morrison says Labor is runing a protection racket for unions.\" He might as well accuse us of running a protection racket for DEMOCRACY. We will never apologise for backing in the working poeple of Australia. #auspol #EnsuringIntegrity",
        "location": "Australia",
        "retweet_count": 147,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong Human Rights and Democracy Act and PROTECT Hong Kong Act legislation supporting the Hong Kong protestors were both signed into law by President Trump today per the White House",
        "location": "Tarpon Springs, FL",
        "retweet_count": 753,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Hong Kong protests Trump signs Human Rights and Democracy Act into law",
        "location": "京都市",
        "retweet_count": 7,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "[Breaking] With the presidential signature S 1838 Hong Kong Human Rights and Democracy Act of 2019 has been enacted as part of the law of the United States We will soon post updates on what to expect next. Official announcement",
        "location": "",
        "retweet_count": 38,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Such a classless disrespectful display of Leftist values.",
        "location": "Somewhere south of Nowhere",
        "retweet_count": 179,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "If we hadn’t flipped the House in 2018 Republicans would control the House Intelligence and Judiciary Committees. Who would hold this administration accountable Who would defend our democracy? Elections matter We can't afford to screw this up.",
        "location": "",
        "retweet_count": 3154,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The President of the United States has officially signed the S.1838 Hong Kong Human Rights and Democracy Act #HKHRDA. The S.2710 A bill to prohibit the commercial export of covered munitions items to the Hong Kong Police Force was also signed into law",
        "location": "",
        "retweet_count": 195,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "BREAKING President Trump has signed the Hong Kong Human Rights and Democracy Act of 2019 \"They are being enacted in the hope that Leaders and Representatives of China &amp Hong Kong will be able to amicably settle their differences leading to long term peace &amp prosperity for all\"",
        "location": "Canada 🇨🇦 ",
        "retweet_count": 305,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Dear Media Folks, Let me save you from yourselves This isn’t an actual photo Thanks Don’t forget “Democracy Dies in the Darkness.",
        "location": "Miami, FL",
        "retweet_count": 1276,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Trump signs legislation designed to support pro-democracy protesters in Hong Kong after previously suggesting he might veto measure",
        "location": "Hong Kong",
        "retweet_count": 212,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Kavanaugh's media coverage and Congressional questioning was the best example of this type of operation: Focus on subjects that elicit disgust but which are inconclusive when it comes to keeping someone inappropriate from an important office in our democracy.",
        "location": "Virginia, USA",
        "retweet_count": 67,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Bipartisan praise on Hill for signing Hong Kong Human Rights and Democracy Bill into law a firm message to China regarding human rights.",
        "location": "United States",
        "retweet_count": 113,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I applaud the people of Hong Kong for their historic vote for freedom democracy and autonomy this weekend!",
        "location": "",
        "retweet_count": 3046,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "It’s so sad for these flight attendants who lose their job for freedom and democracy Who can help them? #FightForFreedom #StandwithHK",
        "location": "",
        "retweet_count": 44,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "BREAKING President has signed into law the Hong Kong Human Rights Democracy Act in support of the city's protesters He also signed another bill that prohibits the export of crowd control equipment to Hong Kong police.",
        "location": "",
        "retweet_count": 294,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "On What's happening in Hong Kong is inspiring We've seen over 2 million people standing up for freedom for democracy &amp standing up against the oppression of the Chinese communist regime It is very much in America’s interests to support freedom fighters in HK",
        "location": "",
        "retweet_count": 7594,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#BREAKING US president Donald Trump has just signed the Hong Kong Human Rights and Democracy Act into the law The act have previously gone through both houses with overwhelming support Tonight at 8 pm people will gather for a celebration #HongKongProtests",
        "location": "Hong Kong",
        "retweet_count": 375,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "If trump Pence Pompeo Giuliani and company get away with this Ukraine shit our “Democracy is fucked up...well it already kinda of is either way but y’all get my drift here.",
        "location": "Dallas",
        "retweet_count": 8,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "HUGE NEWS for freedom &amp democracy in Hong Kong Pro-democracy forces swept yesterday’s elections Had 0 of 18 District Councils now have 17 of 18 Control 385 of 452 seats True mandate from people 71 voted over 3 million Let freedom ring #FreeHongKong",
        "location": "",
        "retweet_count": 2419,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Yes a cannon Exactly what it takes to bring \"democracy to the rest of the world Can't find a better metaphor even if I tried",
        "location": "Barcelona, Venezuela",
        "retweet_count": 35,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "A tremendous victory for freedom and human rights in HK as Pres Trump SIGNED the Hong Kong Human rights &amp Democracy Act #HongKongHumanRightsandDemocracyAct #HK _with_HK _watch #StandWithHK",
        "location": "",
        "retweet_count": 225,
        "favorite_count": 0,
        "time_zone": null
    }
]