[
    {
        "text": "Simple question for whoever interviews Mr Corbyn next Do you think Israel has a right to exist",
        "location": "Tun. Wells, Norfolk & London",
        "created_at": "11/29/19",
        "retweet_count": 2683,
        "favorite_count": 5393,
        "time_zone": null
    },
    {
        "text": "22 of India’s groundwater dried up or in critical state. Now Israel comes forward to help India. Israel is providing guidance &amp training in water management in 28 Centres of Excellence in India Over 7 desalination plants on the coast of India are using Israeli technology",
        "location": "India",
        "created_at": "11/28/19",
        "retweet_count": 3696,
        "favorite_count": 14247,
        "time_zone": null
    },
    {
        "text": "BREAKING Video emerges of bashing the on Iranian TV for “believing that Israel has a right to exist.",
        "location": "United States",
        "created_at": "11/29/19",
        "retweet_count": 3777,
        "favorite_count": 5351,
        "time_zone": null
    },
    {
        "text": "Astonishing video of Corbyn going on Iranian state TV to attack the BBC for saying that “Israel has a right to exist and for saying “Israel is a democracy” Corbyn prefers being paid to back Iran’s stance that Israel should be wiped out",
        "location": "London, UK",
        "created_at": "11/29/19",
        "retweet_count": 523,
        "favorite_count": 638,
        "time_zone": null
    },
    {
        "text": "Iranian MP stands up to the clerics within the regime’s parliament confronts them about killing protestors in Iran and Iraq He is choked and dragged out of the chamber and will most likely be accused of working for Israel or the USA BE FEARLESS #BEFEARLESS",
        "location": "USA | CA | AUS",
        "created_at": "11/29/19",
        "retweet_count": 1323,
        "favorite_count": 2213,
        "time_zone": null
    },
    {
        "text": "WATCH Shocking footage from Iranian TV of Jeremy Corbyn attacking the BBC because of their \"bias towards saying \"Israel has a right to exist\" How can any decent person vote for this disgraceful man?!",
        "location": "United Kingdom",
        "created_at": "11/29/19",
        "retweet_count": 764,
        "favorite_count": 1007,
        "time_zone": null
    },
    {
        "text": "A great move by Bolivia to reestablish diplomatic relations with Israel Definitely a move in the right direction",
        "location": "",
        "created_at": "11/29/19",
        "retweet_count": 353,
        "favorite_count": 2360,
        "time_zone": null
    },
    {
        "text": "1 rocket was just fired from #Gaza at Israel This is the 4th rocket fired from Gaza at Israeli civilians this week.",
        "location": "Israel",
        "created_at": "11/29/19",
        "retweet_count": 705,
        "favorite_count": 1762,
        "time_zone": null
    },
    {
        "text": "Thornberry “No place in Labour for people who deny Israel’s right to exist” Well this is awkward",
        "location": "North Essex",
        "created_at": "11/29/19",
        "retweet_count": 1595,
        "favorite_count": 3401,
        "time_zone": null
    },
    {
        "text": "Jeremy Corbyn \"Israel doesn't have a right to exist\". Sadiq Khan *silence* Leadership is about confronting antisemitism #YourSilenceSpeaksVolumes",
        "location": "London, UK",
        "created_at": "11/29/19",
        "retweet_count": 833,
        "favorite_count": 2748,
        "time_zone": null
    },
    {
        "text": "To all our American friends Israel wishes you a #HappyThanksgiving ",
        "location": "Jerusalem, Israel",
        "created_at": "11/28/19",
        "retweet_count": 263,
        "favorite_count": 1185,
        "time_zone": null
    },
    {
        "text": "The Polish town of Oświęcim once the home of a thriving Jewish community honored their memory in a special inauguration ceremony during which the site which once hosted the Great Synagogue was officially declared as the Great Synagogue Memorial Park",
        "location": "Oświęcim, Polska",
        "created_at": "11/28/19",
        "retweet_count": 595,
        "favorite_count": 2324,
        "time_zone": null
    },
    {
        "text": "Israeli researchers have developed bacteria fed only with carbon dioxide the Weizmann Institute of Science (WIS in central Israel reported on Wednesday Read  IANS",
        "location": "India",
        "created_at": "11/28/19",
        "retweet_count": 3832,
        "favorite_count": 6531,
        "time_zone": null
    },
    {
        "text": "#OnThisDay (Nov 29 in 1947 the #UN passed res 181 which later led to the birth of the State of Israel. ✅33 voted in favor ❌13 voted against 🤔10 abstained ❓1 absent We're proud of Israel's achievements &amp contribution to the in the last 72 yrs ",
        "location": "Jerusalem, Israel",
        "created_at": "11/29/19",
        "retweet_count": 400,
        "favorite_count": 977,
        "time_zone": null
    },
    {
        "text": "\"I think there is a bias towards saying Israel is a democracy in the Middle East That Israel has a right to exist That Israel has its security concerns. For many Jewish people this is the real Jeremy Corbyn And many wish he'd just admit these are his real views",
        "location": "UK",
        "created_at": "11/29/19",
        "retweet_count": 376,
        "favorite_count": 546,
        "time_zone": null
    },
    {
        "text": "A very powerful article in HAARETZ an Israeli newspaper \"Corbyn is not an anti-Semite He never was His real sin is his staunch position against injustice in the world including the version Israel perpetrates\". Everyone needs to read it",
        "location": "Cape Town, South Africa",
        "created_at": "11/30/19",
        "retweet_count": 1559,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "'An eye for an eye' The Jews who sought to poison six million Germans to avenge the Holocaust Israel News",
        "location": "Weimerica",
        "created_at": "11/30/19",
        "retweet_count": 226,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I've repeatedly written that Japan is India's most important friend Now Japan is considering NOT signing the Chinese-backed RCEP without India. Russia needs China Israel doesn't see China as a direct threat This makes Japan our most significant ally",
        "location": "New Delhi, India",
        "created_at": "11/30/19",
        "retweet_count": 33,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "If Morrison the #PaedophileProtector of cult Brian Houston &amp child raping priests plus money grubbers like Israel Folau are examples of 'christians they are something secular Australia should avoid at all costs ! KEEP.RELIGION.OUT.OF.POLITICS",
        "location": "Australia",
        "created_at": "11/30/19",
        "retweet_count": 11,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Pfffffft Climate change is Farce! You know kinda like you #corbyn Long live Israel &amp the Jewish people Anyone that calls hamas a friend &amp lays a wreath for the terrorists that killed jewish olympians in 72 Munich games is a enemy of the Jewish people &amp an enemy of The USA",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 42,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "For further reading",
        "location": "Orlando, FL",
        "created_at": "11/30/19",
        "retweet_count": 76,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Israel recently bombed 4 countries in 48 hours Iraq Syria Lebanon &amp Palestine Yet it's hardly mentioned on mainstream media. Why is there not similar outrage to the recent bombing of Saudi oil fields",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 401,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The left fuck you whitey give black and brown people everything you own and built The right the same but adds Israel to the gibs list Our side be of service honor your heritage stay in shape start a family The media why is the \"far right becoming so popular?",
        "location": "USA",
        "created_at": "11/30/19",
        "retweet_count": 56,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "On our newest episode of The +972 Podcast Attorney Emily Schaeffer Omer-Man explains how in deporting Human Rights Watch's Israel is now policing the speech and political opinions of human rights advocates:",
        "location": "http://facebook.com/c4peace",
        "created_at": "11/30/19",
        "retweet_count": 16,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Morrison delays religious bill Apparently the present offering doesn't condemn enough people No excuse really.. Israel Folau gave him a list. #FreedomfromReligion #auspol",
        "location": "Diggers Rest, Victoria",
        "created_at": "11/30/19",
        "retweet_count": 16,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "As you can see in the video a Zionist man asks Siri where the capital of Israel is When Siri says there is no place called Israel he says that artificial intelligence called Siri is an enemy of the Jews. Israel is not a Jewish state. Israel does not represent us",
        "location": "Charsadda, Pakistan",
        "created_at": "11/30/19",
        "retweet_count": 242,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "this is truly the craziest sponsored ad I’ve gotten Israel is using Frozen 2 to support heightened sanctions against Iran",
        "location": "Islamabad, Pakistan",
        "created_at": "11/30/19",
        "retweet_count": 173,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Israeli forces kill Palestinian teenage boy in #Gaza #Israel #FreePalestine",
        "location": "Texas",
        "created_at": "11/30/19",
        "retweet_count": 12,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "This is not being pro Palestinian This is hating Israel and refusing to accept its legitimacy to exist Pure racism in a nutshell",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 266,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "#LiberalLunacy at it’s finest! GOP welcomes all Legal Immigrants &amp races Dems keep spreading the lie saying we’re racist but in reality they are racist Dems and “the squad are anti Semitic anti Israel That’s racist Pot calling the kettle black!#DemocratsAreTotallyInsane",
        "location": "United States",
        "created_at": "11/30/19",
        "retweet_count": 34,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Fuck Israel",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 7525,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Mundhu aa Rules Change Cheyandi ra Kodakallara Punishment for rape in world: China Death Saudi hang in public N.Korea death by fire Israel hang Afghan hang India anti rape bill 2013 act imprisonment for 14years ? #RIPPriyankaReddy",
        "location": "Earth",
        "created_at": "11/30/19",
        "retweet_count": 642,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Israel deported Human Rights Watch's Omar Shakir for documenting Israeli human rights abuses But Shakir will continue his work from a neighboring country \"The Israeli government has failed to muzzle HRW or the human rights movement",
        "location": "İstanbul",
        "created_at": "11/30/19",
        "retweet_count": 23,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The #Daesh and #Nusra death cults created by #Washington through the #Saudis and with help from #Turkey #Israel and #Qatar to destroy both #Iraq and #Syria has left tens of thousands of psychologically damaged children like this one",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 168,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "listen China and Israel is now top 2 of the country i hate the most U cant tell me otherwise",
        "location": "Malaysia",
        "created_at": "11/30/19",
        "retweet_count": 9719,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "RIGHT NOW Air-raid sirens sounding across southern Israel",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 506,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Opinion The reasons why I’m glad I’m raising my kids in Israel.",
        "location": "Arizona, USA",
        "created_at": "11/30/19",
        "retweet_count": 11,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "A staggering statistic Most of the 313 Tory members of the previous Parliament have visited Israel Little wonder Palestinians can't find a single friend in the UK Tory Party!",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 43,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Punishment for Rape across the Globe: 1 Egypt The rapist is hanged till death. 2 Israel Rape convict gets 4 years minimum &amp 16 years maximum imprisonment 3 UAE punishment for Rape is Death 4 China Rape is considered as a brutal crime &amp Death Penalty is awarded to Rapist.",
        "location": "Vrindavan, India",
        "created_at": "11/30/19",
        "retweet_count": 69,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I always said Japan is our best friend Even more than Israel and Russia. Japan won’t sign China-backed RCEP if India doesn’t join",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 17,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Today in Gaza: —300 UNARMED Palestinians protest 100m from Israel's fence. —IDF targets them kills 1⃣child shoots 5⃣children &amp 2⃣adults —Gaza militants retaliate w 1⃣“rocket\" No death/damage in Israel —Israel shoots 3⃣missiles into Gaza Serious damage in Gaza",
        "location": "New Mexico, USA",
        "created_at": "11/30/19",
        "retweet_count": 27,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Most #UN resolutions and world protests and condemnations are against #Israel Meanwhile in too many other counties things like this happen which would never occur in Israel #DoubleStandards #IsraelBashing",
        "location": "Utopia ( ˘˘̯) ( ˘˘̯)",
        "created_at": "11/30/19",
        "retweet_count": 56,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Russia's Amb to Israel Anatoly Viktorov tells Israel's English info channel \"close partner Iran is staying put in Syria Putin's project to gain year-round warm water port access in the Med along with control of most of the MidEast oil is almost comlete Trump got played",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 676,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "100 students at _Law walk out on a talk hosting extremist settler leader and current Consulate General of Israel in New York Dani Dayon Dayon was left to speak to an almost empty room",
        "location": "Bay Area, CA",
        "created_at": "11/30/19",
        "retweet_count": 7242,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Drop the dead donkey israel is not a democracy &amp it never has been. but it does have the worst poverty rate in all of the developed world",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 329,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Today we remember Tom Hurndall executed by an israeli sniper 16yrs ago while he was rescuing Palestinian children from israel's gunfire",
        "location": "Australian Capital Territory",
        "created_at": "11/30/19",
        "retweet_count": 376,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Louis CK a half hungarian jew who made a joke TO a crowd of JEWS in ISRAEL that hed rather be in auschwitz than NYC rn which made them laugh non jewish far left comedy police on the other side of the world",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 105,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Fact Jerusalem is the capital of Israel Fact Judea and Samaria is the heartland of Israel Fact Jewish \"settlements do not violate \"international law\" Fact IDF is by far the most moral army in the world. Don't like it? Guess what.. Facts don't care about your feelings.",
        "location": "Florida, USA",
        "created_at": "11/30/19",
        "retweet_count": 97,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "I am sorry if I sound like a broken record but Israel is bombing #Gaza again #GazaUnderAttack",
        "location": "Lahore - Pakistan",
        "created_at": "11/30/19",
        "retweet_count": 80,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "The forgotten people by so-called “Islamic Nations” because #Uyghurs cause will not make a heroic Islamic leader In the middle east it’s easy to become a hero you scream against Israel and Mossad Chinese money is sweeter Muslim Uyghurs are bitter #Uyghurmuslims",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 55,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Prasad's evasive answers in Parl to direct questions on the snooping of &gt;100 Journos lawyers&amp;human rights activists through Israeli software Pegasus confirms that Govt had surreptitiously bought this software &amp targeted citizens in violation of SC orders",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 355,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "israel &amp bolivia haven’t had ties since 2009 when the IDF massacred over 1400 palestinians in gaza as part of ‘operation cast lead.’ evo not only cut off all ties to israel but called for its prime minister &amp his cabinet to face charges of genocide in the international court",
        "location": "bk",
        "created_at": "11/30/19",
        "retweet_count": 337,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "UN report says Israel is a 'racist state &amp 'apartheid regime but Israel says that's 'Nazi propaganda",
        "location": "UK ",
        "created_at": "11/30/19",
        "retweet_count": 123,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Kita post or retweet ramai2 or banyak2!! Shame of you Israel! You are not human!",
        "location": "",
        "created_at": "11/30/19",
        "retweet_count": 60267,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "Those who invoke the “right to exist argument so fervently for Israel never seem to do it for Palestinians which kinda undermines the entire premise of the argument",
        "location": "Preston, UK",
        "created_at": "11/30/19",
        "retweet_count": 11,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "If you watch the video this is a misrepresentation of what he says Also the question of Israel’s right to exist is brought up most by Israel itself in its PR campaign against BDS",
        "location": "Preston, UK",
        "created_at": "11/30/19",
        "retweet_count": 15,
        "favorite_count": 0,
        "time_zone": null
    },
    {
        "text": "On this day in 1947 the United Nations formally partitions Israel and Palestine The move is supposed to bring peace to the Middle East #SpoilerAlert It doesn't",
        "location": "Berlin, Deutschland",
        "created_at": "11/30/19",
        "retweet_count": 105,
        "favorite_count": 0,
        "time_zone": null
    }
]